test/LES_dynamickEqn_pimple_pipe/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-5;
//inlet turbulent KE (k) for BC (LES) can be 0.2 times of inlet k for RAS
boundaryField
{
    wall
    {
        type            fixedValue;
        value           uniform 0;
    }

    topPatch
    {
        type            fixedValue;
        value           $internalField;
    }

    bottomPatch
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
