test/LES_dynamickEqn_pimple_pipe/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType      LES;

RAS
{
    RASModel        kOmegaSST;

    turbulence      on;

    printCoeffs     on;

    //alphaK1         500;
}

LES
{
    LESModel        dynamicKEqn;

    turbulence      on;

    printCoeffs     on;

    //alphaK1         500;
    
    delta           cubeRootVol;
    dynamicKEqnCoeffs
    {
        filter          simple;
    }
}
// ************************************************************************* //
